LEXICON_RU: dict[str, str] = {
    'YES': 'Да👍',
    'NO': 'Нет👎',
    'SKIP': 'Пропустить.',
    'WELCOME': "Добро пожаловать! Я языковой бот.\nПожалуйста выберите одну из функций!",
    'OPTIONS': 'Настройки аккаунта🛠',
    'NEW': 'Новые слова🆕',
    'OLD': 'Повторение🔄',
    'BACK': 'Назад🔙',
    'CANCEL': 'Отмена🙅‍♂️',

    'LEXICON_COMMANDS': {
        '/start': 'Начать',
        '/new_lesson': 'Начать новое занятие.',
        '/repetition': 'Повторение старых слов.',
        '/settings': 'Редактирование информации пользователя\nи библиотеки слов.',
        '/help': 'Помощь.',
        '/return': 'Вернуться в главное меню.',
        },

    'START_MESSAGE': '''Добро пожаловать в языкового бота!
Для начала занятия нажмите /new_lesson
Для повторения нажмите /repetition
Для входа в настройки /settings
Для помощи нажмите /help''',
    'HELP_MESSAGE': '''Этот бот создан для изучения слов.
Нажмите /new lesson для изучения новых слов.
Нажмите /repetition для повторения старых слов.
Для входа в настройки нажмите /settings.
Для возвращения в главное меню нажмите /return''',
    'LESSON_START': 'Начинаем новое занятие.',
    'SETTINGS_DESCR': 'Здесь можно изменить данные пользователя,\nотредактировать базу слов\nи изменить язык.',
    'BACK_TO_MENU': 'Пожалуйста выберите одну из опций.',

    'REGISTRATION_INITIALIZATION': 'Пожалуйста выберите язык.',
    'NAME_SELECTION': 'Пожалуйста введите имя.📝',
    'INCORRECT_NAME': 'Имя может содержать только буквы.',
    'AGE_ENTER': 'Введите возраст.🧒🏻👨🏻👴🏻',
    'INCORRECT_AGE': 'Возраст может содержать только числа от 5 до 110.',
    'AVATAR_SELECTION': 'Выберите аватар📷или нажмите кнопку "Пропустить.".',
    'TAP_TO_SKIP': 'Нажми меня!',
    'INCORRECT_DATA': 'Аватар должен быть изображением.',
    'REGISTRATION_FINISHED': 'Успешная регистрация.',
    'RU': 'Русский.🇷🇺',
    'EN': 'English.🇬🇧',

    'LIBRARY_IS_EMPTY': 'Нет слов для повторения.\nПожалуйста используйте /new_lesson для изучения новых слов.',
    'AMOUNT_SELECTION': 'Пожалуйста выберите количество слов на клавиатуре внизу:',
    'INCORRECT_AMOUNT': 'Количество должно быть числом от 10 до 40.',
    'NOT_ENOUGH_WORDS': "В вашей библиотеке недостаточно слов для повторения. Пожалуйста пройдите новое занятие.",
    'LESSON_IS_OVER': 'Занятие окончено.\nХотите повторить?',
    'REPEAT_LESSON': 'Повторить занятие.',
    'FINISH_LESSON': 'Завершить занятие.',
    'LESSON_STARTING': 'Пожалуйста подождите🕔, Занятие начинается...',
    'RIGHT_ANSWER': '🎉Правильный ответ!🎉',
    'INCORRECT_ANSWER': 'Неправильный ответ!❌Правильный ответ: ',

    'CRASH': 'Ой... что то пошло не так!🙈',
    'UNSUPPORTED': ''' неподдерживаемая команда.
Вы можете использовать /return чтобы вернуться в главное меню.
Если вы не зарегистрированы, используйте команду /start и
пройдите регистрацию.''',

    'MAIN_MENU': 'Пожалуйста выберите одну из опций ниже⬇️:',

    'USER': 'Настройка информации пользователя',
    'INFO_EDIT_INITIALIZATION': "Так ваш профиль выглядит сейчас.\nЧто вы хотите изменить?",
    'NAME': 'Имя.',
    'AGE': 'Возраст.',
    'AVATAR': 'Аватар.',

    'EDIT_NAME': 'Пожалуйста введите новое имя.',
    'EDIT_AGE': 'Пожалуйста введите новый возраст.',
    'EDIT_AVATAR': 'Пожалуйста выберите новое фото.📷',
    'EDITING_SUCCESS': 'Информация изменена успешно.',

    'LIBRARY': '📖Редактирование библиотеки слов.📖',

    'LIBRARY_EDIT_INITIALIZATION': 'Выберите одну из опций ниже⬇️:',
    'EDIT': '📖Изменить библиотеку.📖',

    'DELETE': '❌',
    'DESCR': 'Используйте ✅ и ❎ для того, чтобы отметить выученным/не выученным.\nИспользуйте ❌ для удаления слов.',
    'CLEAR': 'Очистить библиотеку.♻️',
    'CONFIRMATION': 'Введите "CLEAR LIBRARY" для подтверждения.',
    'SUCCESS': 'Библиотека очищена.✅',
    'LEARNED': '✅',
    'NOT_LEARNED': '❎',
    'NEXT': '➡️',
    'NEXT_DESCR': 'Следующая страница библиотеки.',
    'PREV': '⬅️',
    'ADD': 'Добавить новое слово.',
    'WORD': '✍️Введите новое слово пожалуйста.',
    'TRANSLATION': '✍️Введите перевод слова',
    'WORD_EXIST': '⛔️Слово уже существует.',
    'WORD_ADDED': '✅Слово успешно доставлено.',

    'LANGUAGE': 'Язык.',
    'LANGUAGE_CHOICE': 'Выберите один из языков ниже⬇️.',
    'LANGUAGE_CHANGED': '✅Язык успешно изменен.',
    'LANGUAGE_NOT_CHANGED': '⛔Ошибка. Язык не был изменен'

}
